app/Controllers/Admin.php

    public function users()
    {
        $data = [
            'title' => 'Пользователи | HGS CMS',
            'users' => $this->userModel->findAll()
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'