app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `posts`
WHERE `user_id` = '4'
---
    public function index()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);
        $posts = $this->postModel->where('user_id', $userId)->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function edit()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);